logs/fio-diskrnd/slurm/001/log008.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;91948;359;91232;0;0;0.000000;0.000000;94;53226;2771.943197;5733.301297;1.000000%=97;5.000000%=98;10.000000%=101;20.000000%=110;30.000000%=113;40.000000%=115;50.000000%=123;60.000000%=152;70.000000%=185;80.000000%=6979;90.000000%=10944;95.000000%=14876;99.000000%=23461;99.500000%=32899;99.900000%=38535;99.950000%=39059;99.990000%=39059;0%=0;0%=0;0%=0;97;53229;2775.582213;5733.158717;8704;1143808;100.000000%;92027.780220;128342.546925;0.169898%;5.215333%;7304;0;224;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;7.51%;70.72%;0.16%;0.00%;0.00%;0.09%;0.01%;9.94%;10.13%;1.45%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;110;20545;0;0;4408;312764;317172;93.49%;slaves;122;29244;0;84;5199;318458;324664;99.16%;sda;122;29244;0;84;5199;318458;324664;99.16%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=84947: Fri Dec  1 18:55:40 2023
  write: IOPS=359, BW=89.8MiB/s (94.2MB/s)(8192MiB/91232msec); 0 zone resets
    clat (usec): min=94, max=53226, avg=2771.94, stdev=5733.30
     lat (usec): min=97, max=53229, avg=2775.58, stdev=5733.16
    clat percentiles (usec):
     |  1.00th=[   98],  5.00th=[   99], 10.00th=[  102], 20.00th=[  111],
     | 30.00th=[  114], 40.00th=[  116], 50.00th=[  124], 60.00th=[  153],
     | 70.00th=[  186], 80.00th=[ 6980], 90.00th=[10945], 95.00th=[14877],
     | 99.00th=[23462], 99.50th=[32900], 99.90th=[38536], 99.95th=[39060],
     | 99.99th=[39060]
   bw (  KiB/s): min= 8704, max=1143808, per=100.00%, avg=92027.78, stdev=128342.55, samples=182
   iops        : min=   34, max= 4468, avg=359.48, stdev=501.34, samples=182
  lat (usec)   : 100=7.51%, 250=70.72%, 500=0.16%
  lat (msec)   : 2=0.09%, 4=0.01%, 10=9.94%, 20=10.13%, 50=1.45%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.17%, sys=5.22%, ctx=7304, majf=0, minf=224
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=89.8MiB/s (94.2MB/s), 89.8MiB/s-89.8MiB/s (94.2MB/s-94.2MB/s), io=8192MiB (8590MB), run=91232-91232msec

Disk stats (read/write):
    dm-0: ios=110/20545, merge=0/0, ticks=4408/312764, in_queue=317172, util=93.49%, aggrios=122/29244, aggrmerge=0/84, aggrticks=5199/318458, aggrin_queue=324664, aggrutil=99.16%
  sda: ios=122/29244, merge=0/84, ticks=5199/318458, in_queue=324664, util=99.16%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;197923;773;42383;0;0;0.000000;0.000000;582;154438;1289.756767;4950.722261;1.000000%=774;5.000000%=798;10.000000%=806;20.000000%=823;30.000000%=847;40.000000%=856;50.000000%=864;60.000000%=864;70.000000%=880;80.000000%=913;90.000000%=962;95.000000%=1433;99.000000%=3784;99.500000%=34340;99.900000%=81264;99.950000%=101187;99.990000%=116916;0%=0;0%=0;0%=0;582;154438;1290.034610;4950.723196;2560;301568;99.572729%;197077.333333;129884.408000;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.403473%;10.388844%;32791;0;287;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.26%;93.49%;2.13%;3.23%;0.25%;0.08%;0.22%;0.27%;0.06%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;33766;2140;0;0;39537;31964;71501;96.26%;slaves;34551;3684;12;29;44195;29862;74181;97.34%;sda;34551;3684;12;29;44195;29862;74181;97.34%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=85332: Fri Dec  1 18:56:23 2023
  read: IOPS=773, BW=193MiB/s (203MB/s)(8192MiB/42383msec)
    clat (usec): min=582, max=154438, avg=1289.76, stdev=4950.72
     lat (usec): min=582, max=154438, avg=1290.03, stdev=4950.72
    clat percentiles (usec):
     |  1.00th=[   775],  5.00th=[   799], 10.00th=[   807], 20.00th=[   824],
     | 30.00th=[   848], 40.00th=[   857], 50.00th=[   865], 60.00th=[   865],
     | 70.00th=[   881], 80.00th=[   914], 90.00th=[   963], 95.00th=[  1434],
     | 99.00th=[  3785], 99.50th=[ 34341], 99.90th=[ 81265], 99.95th=[101188],
     | 99.99th=[116917]
   bw (  KiB/s): min= 2560, max=301568, per=99.57%, avg=197077.33, stdev=129884.41, samples=84
   iops        : min=   10, max= 1178, avg=769.83, stdev=507.36, samples=84
  lat (usec)   : 750=0.26%, 1000=93.49%
  lat (msec)   : 2=2.13%, 4=3.23%, 10=0.25%, 20=0.08%, 50=0.22%
  lat (msec)   : 100=0.27%, 250=0.06%
  cpu          : usr=0.40%, sys=10.39%, ctx=32791, majf=0, minf=287
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=193MiB/s (203MB/s), 193MiB/s-193MiB/s (203MB/s-203MB/s), io=8192MiB (8590MB), run=42383-42383msec

Disk stats (read/write):
    dm-0: ios=33766/2140, merge=0/0, ticks=39537/31964, in_queue=71501, util=96.26%, aggrios=34551/3684, aggrmerge=12/29, aggrticks=44195/29862, aggrin_queue=74181, aggrutil=97.34%
  sda: ios=34551/3684, merge=12/29, ticks=44195/29862, in_queue=74181, util=97.34%